AUTO_config_TK_pesok/src/DataProcessors/ТК_ВводНаОснованииИзменениеЦен/ТК_ВводНаОснованииИзменениеЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_ВводНаОснованииИзменениеЦен</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Documents/ИзменениеЦен/ИзменениеЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеЦен</name>
  <comment>Изменение цен компании и контрагентов</comment>
  <basedOn>Document.ПротоколСогласованияЦен</basedOn>
  <basedOn>Document.ИзменениеЦен</basedOn>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>Тип цен закупки</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйТипЦен</name>
    <comment>Тип цен относительно которого производим расчет</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <comment>Дата начала действия</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ИзменениеЦен</types>
      <types>DocumentRef.ПротоколСогласованияЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(АСУ) Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБазовая</name>
      <comment>Цена относительно которой прозводится расчет новой цены</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНаценки</name>
      <comment>Наценка на базовую цену для вычисления устанавливаемой цены</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекомендуемыйПроцентНаценкиНоменклатура</name>
      <comment>Наценка на базовую цену для вычисления устанавливаемой цены</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекомендуемыйПроцентНаценкиРодитель</name>
      <comment>Наценка на базовую цену для вычисления устанавливаемой цены</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекомендуемыйПроцентНаценкиТип</name>
      <comment>Наценка на базовую цену для вычисления устанавливаемой цены</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекомендуемыйПроцентНаценкиГруппаЦенообразования</name>
      <comment>Наценка на базовую цену для вычисления устанавливаемой цены</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкруглятьДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/ПротоколСогласованияЦен/ПротоколСогласованияЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколСогласованияЦен</name>
  <comment>Протокол согласования цен</comment>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>InformationRegister.СогласованиеЦенАкция</registerRecords>
  <registerRecords>InformationRegister.СогласованиеЦен</registerRecords>
  <registerRecords>InformationRegister.ЦеныКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>Тип цен закупки</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <comment>Срок действия протокола</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтклонения</name>
    <comment>Процент отклонения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <comment>Дата начала действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПротоколовСогласованияЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(АСУ) Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНалогов</name>
      <comment>Цена номенклатурной позиции (без НДС)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/ТипыЦен/ТипыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦен</name>
  <comment>Типы цен</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НормативнаяЦена</name>
      <description>Нормативная цена</description>
    </items>
    <items>
      <name>ОсновнойТипЦенЗакупки</name>
      <description>Основной тип цен закупки</description>
    </items>
    <items>
      <name>ОсновнойТипЦенПродажи</name>
      <description>Основной тип цен продажи</description>
    </items>
  </predefined>
  <attributes>
    <name>БазовыйТипЦен</name>
    <comment>Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаЦены</name>
    <comment>Валюта цены (для цен не в валюте учета товара)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <comment>Вид оплаты</comment>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенЗаБлок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Не вести учет по характеристикам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <comment>Истина - цена включает НДС, ложь - цена НДС не включает</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <comment>Количество значащих знаков цены после запятой</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ТК_ВводНаОснованииИзменениеЦен/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНаОснованииИзмененияЦен(ИзменениеЦен, МассивТиповЦен, ПроводитьДокументы, Статистика = Неопределено, Параметры = Неопределено) Экспорт 
	БезПараметров = Ложь;
	
	Если Статистика = Неопределено Тогда 
		Статистика = Новый Структура;
	КонецЕсли;	
	Статистика.Вставить("Создано", 0);
	Статистика.Вставить("СОшибками", 0);
	
	Если Не Параметры = Неопределено Тогда
		БезПараметров = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивТиповЦен", МассивТиповЦен);

	Если ТипЗнч(ИзменениеЦен) = Тип("ДокументСсылка.ИзменениеЦен") Тогда
		Запрос.УстановитьПараметр("Ссылка", ИзменениеЦен);
		Запрос.Текст = "ВЫБРАТЬ
	               |	ИзменениеЦен.Ссылка КАК ДокументОснование,
	               |	ИзменениеЦен.Организация КАК Организация,
	               |	ИзменениеЦен.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ИзменениеЦен.КурсДокумента КАК КурсДокумента,
	               |	ИзменениеЦен.Товары.(
	               |		Номенклатура КАК Номенклатура,
	               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		НоваяЦена КАК ЦенаБазовая
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ИзменениеЦен КАК ИзменениеЦен
	               |ГДЕ
	               |	ИзменениеЦен.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТипыЦен.Ссылка КАК ТипЦен,
	               |	ТипыЦен.БазовыйТипЦен КАК БазовыйТипЦен,
	               |	ТипыЦен.ВалютаЦены КАК ВалютаДокумента,
	               |	ТипыЦен.ВариантОкругления КАК ВариантОкругления,
	               |	ТипыЦен.Точность КАК Точность,
	               |	ТипыЦен.ПравилоРасчета КАК ПравилоРасчета
	               |ИЗ
	               |	Справочник.ТипыЦен КАК ТипыЦен
	               |ГДЕ
	               |	ТипыЦен.Ссылка В(&МассивТиповЦен)";

	Иначе 
	Запрос.УстановитьПараметр("Ссылка", ИзменениеЦен);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколСогласованияЦен.Ссылка КАК ДокументОснование,
	               |	ПротоколСогласованияЦен.Организация КАК Организация,
	               |	ПротоколСогласованияЦен.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ПротоколСогласованияЦен.КурсДокумента КАК КурсДокумента,
	               |	ПротоколСогласованияЦен.Товары.(
	               |		Номенклатура КАК Номенклатура,
	               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		Цена КАК ЦенаБазовая
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ПротоколСогласованияЦен КАК ПротоколСогласованияЦен
	               |ГДЕ
	               |	ПротоколСогласованияЦен.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТипыЦен.Ссылка КАК ТипЦен,
	               |	ТипыЦен.БазовыйТипЦен КАК БазовыйТипЦен,
	               |	ТипыЦен.ВалютаЦены КАК ВалютаДокумента,
	               |	ТипыЦен.ВариантОкругления КАК ВариантОкругления,
	               |	ТипыЦен.Точность КАК Точность,
	               |	ТипыЦен.ПравилоРасчета КАК ПравилоРасчета
	               |ИЗ
	               |	Справочник.ТипыЦен КАК ТипыЦен
	               |ГДЕ
	               |	ТипыЦен.Ссылка В(&МассивТиповЦен)";
	КонецЕсли;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РеквизитыИзменениеЦен = МассивРезультатов[0].Выбрать();
	
	СтруктураРеквизитов = Новый Структура("ДокументОснование, Организация, ПодразделениеКомпании, КурсДокумента");	
	
	РеквизитыИзменениеЦен.Следующий();	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, РеквизитыИзменениеЦен);
	
	СтруктураРеквизитов.Вставить("Дата", ТекущаяДата());
	СтруктураРеквизитов.Вставить("ДатаНачалаДействия", ТекущаяДата());
	СтруктураРеквизитов.Вставить("ХозОперация", ПредопределенноеЗначение("Справочник.ХозОперации.ИзменениеЦен"));
	
	ТаблицаТовары = РеквизитыИзменениеЦен.Товары.Выгрузить();
	
	Если ТаблицаТовары.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	РежимЗаписи = ?(ПроводитьДокументы, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
	
	ВыборкаТипыЦен = МассивРезультатов[1].Выбрать();
	Пока ВыборкаТипыЦен.Следующий() Цикл 
		
		СтруктураТипаЦен = Новый Структура("ТипЦен, БазовыйТипЦен, ВалютаДокумента");
		ЗаполнитьЗначенияСвойств(СтруктураТипаЦен, ВыборкаТипыЦен);
		
		Если БезПараметров Тогда
			ОкруглятьДо = Параметры.ОкруглятьДо;
		Иначе
			ОкруглятьДо =  1 / Pow(10, ВыборкаТипыЦен.Точность);
		КонецЕсли;
				
		СтруктураТипаЦен.Вставить("ОкруглятьДо",ОкруглятьДо);
		
		
		ПараметрыОкргуления = Новый Структура;
		Если НЕ ОкруглятьДо = 0 Тогда
			Если ОкруглятьДо = 0.9 Тогда
				ПараметрыОкргуления.Вставить("ОкруглятьДо", 1);
			Иначе
				ПараметрыОкргуления.Вставить("ОкруглятьДо", ОкруглятьДо);
			КонецЕсли;
		КонецЕсли;
		ПараметрыОкргуления.Вставить("ВариантОкругления", ВыборкаТипыЦен.ВариантОкругления);
		ПараметрыОкргуления.Вставить("Точность",  ВыборкаТипыЦен.Точность);

		
		
		ДокИЦ = Документы.ИзменениеЦен.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(ДокИЦ, СтруктураРеквизитов);
		ЗаполнитьЗначенияСвойств(ДокИЦ, СтруктураТипаЦен);
		
		Если БезПараметров Тогда
		   	ДокИц.ДатаНачалаДействия = Параметры.ДатаНачалаДействия;
		КонецЕсли;
		
		//ДокИЦ.УстановитьНовыйНомер();
		
		ДокИЦ.Товары.Загрузить(ТаблицаТовары);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьРекомендованныеНаценки", Новый Структура("ТипЦен", ДокИЦ.ТипЦен));
		СтруктураДействий.Вставить("ЗаполнитьПроцентНаценкиИзРекомендованных");
		СтруктураДействий.Вставить("ПересчитатьНовуюЦенуПоПроцентуНаценки",ВыборкаТипыЦен.ПравилоРасчета);	
		СтруктураДействий.Вставить("ПересчитатьНовуюЦенуСУчетомОкругления", ПараметрыОкргуления);
		СтруктураДействий.Вставить("ПересчитатьПроцентНаценкиИзНовойЦены");

		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокИЦ.Товары, СтруктураДействий, КэшированныеЗначения);
		
		//Начало Задача от Баффет Svat 18.08.23
		Если ОкруглятьДо = 0.9 Тогда
			Для Каждого тСтр Из ДокИЦ.Товары Цикл
				тСтр.НоваяЦена = тСтр.НоваяЦена-0.1;				
			КонецЦикла;
		КонецЕсли;
		//Конец Задача от Баффет Svat 18.08.23
		
		Попытка
			ДокИЦ.Записать(РежимЗаписи);
			Статистика.Вставить("Создано", Статистика.Создано + 1);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Статистика.Вставить("СОшибками", Статистика.СОшибками + 1);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти	



#КонецЕсли
